# Before you start :
   - These exercises are related to the Subsetting and Descriptive Stats lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [1]:
import numpy as pd
import random
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
from scipy.stats import trim_mean, mode, skew, gaussian_kde, pearsonr, spearmanr

# Challenge 1

#### In this challenge we will use the `Temp_States.csv` file. 

#### First import it into a data frame called `temp`.

In [9]:
temp = pd.read_csv("Temp_States.csv",encoding = "ISO-8859-1", dtype=str
)

#### Print `temp`

In [10]:
temp

         City        State         Temperature
0         NYC     New York  19.444444444444443
1      Albany     New York   9.444444444444445
2     Buffalo     New York  3.3333333333333335
3    Hartford  Connecticut   17.22222222222222
4  Bridgeport  Connecticut  14.444444444444445
5      Treton   New Jersey   22.22222222222222
6      Newark   New Jersey                20.0

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [27]:
temp.dtypes

City           object
State          object
Temperature    object
dtype: object

#### Select the rows where state is New York

In [29]:
New_york = temp.loc[temp["State"]== "New York"]
New_york

      City     State         Temperature
0      NYC  New York  19.444444444444443
1   Albany  New York   9.444444444444445
2  Buffalo  New York  3.3333333333333335

#### What is the average of the temperature of cities in New York?

In [45]:
#First we have to convert the data from the column Temperature into a float
temp["Temperature"] = temp["Temperature"].astype(float)

In [46]:
New_york["Temperature"].mean()

10.74074074074074

#### We want to know cities and states with Temperature above 15 degress Celcius

In [50]:
weather = temp.loc[temp["Temperature"]> 15]
weather

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [51]:
weather["City"]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [54]:
weather[weather[ 'Temperature'] < 20]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [10]:
# your answer here

# Challenge 2

#### Load the `employee.csv` file into a DataFrame. Call the dataframe `employee`

In [11]:
employee = pd.read_csv("employee.csv",encoding = "ISO-8859-1", dtype=str
)
employee

     Name Department Education Gender      Title Years Salary
0    Jose         IT  Bachelor      M    analyst     1     35
1   Maria         IT    Master      F    analyst     2     30
2   David         HR    Master      M    analyst     2     30
3   Sonia         HR  Bachelor      F    analyst     4     35
4  Samuel      Sales    Master      M  associate     3     55
5     Eva      Sales  Bachelor      F  associate     2     55
6  Carlos         IT    Master      M         VP     8     70
7   Pedro         IT       Phd      M  associate     7     60
8     Ana         HR    Master      F         VP     8     70

#### Explore the data types of the Temp dataframe. Comment your results

In [12]:
# your answer here

#### Show visually the frequency distribution (histogram) of the employee dataset. In few words describe these histograms?

In [13]:
# your answer here

#### What's the average salary in this company?

In [14]:
# your answer here

#### What's the highest salary?

In [33]:
# your answer here

#### What's the lowest salary?

In [15]:
# your answer here

#### Who are the employees with the lowest salary?

In [16]:
# your answer here

#### Could you give all the information about an employee called David?

In [17]:
# your answer here

#### Could you give only David's salary?

In [18]:
# your answer here

#### Print all the rows where job title is associate

In [19]:
# your answer here

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [20]:
# your answer here- 1 method

In [21]:
# your answer here- 2nd method

#### Find the employees who's title is associate and the salary above 55?

In [22]:
# your answer here

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [25]:
# your answer here

####  What is the average Salary per title?

In [23]:
# your answer here

#### Show a visual summary of the data using boxplot. What Are the First and Third Quartiles? Comment your results.
##### * Hint : Quantiles vs Quartiles*
##### - `In Probability and Statistics, quantiles are cut points dividing the range of a probability distribution into continuous intervals with equal probabilities. When division is into four parts the values of the variate corresponding to 25%, 50% and 75% of the total distribution are called quartiles.`

In [26]:
# draw boxplot here

In [27]:
# print first quartile here

In [28]:
# print third quartile here

#### Is the mean salary per gender different?

In [29]:
# your answer here

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [30]:
# your answer here

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [32]:
# your answer here

# Challenge 3

#### Open the Orders.csv dataset. Name your dataset orders

In [18]:
orders= pd.read_csv("Orders.csv",encoding = "ISO-8859-1", dtype=str
)
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.299999999999999
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.0
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.2
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.1,12680,France,12.600000000000001
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.6
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.6
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.850000000000001

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [ ]:
# your answer here

In [ ]:
# your answer here

####  What is the average Purchase Price?

In [ ]:
# your answer here

#### What were the highest and lowest purchase prices?

In [ ]:
# your answer here

In [ ]:
# your answer here

#### Select all the customers we have in Spain

In [ ]:
# your answer here

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

In [ ]:
# your answer here

#### Select all the customers who have bought more than 50 items ?

In [ ]:
# your answer here

#### Select orders from Spain that are above 50 items

In [ ]:
# your answer here

#### Select all free orders

In [ ]:
# your answer here

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [ ]:
# your answer here

#### Select all orders that are made in 2011 and are 'lunch bag'

In [ ]:
# your answer here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your answer here

#### Select all orders made in the month of August

In [ ]:
# your answer here

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [ ]:
# your answer here

#### What's the  average amount of money spent by country

In [ ]:
# your answer here

#### What's the most expensive item?

In [ ]:
# your answer here

#### What was the average amount spent per year ?

In [ ]:
# your answer here